cfd-simulation/boxfish/U_1p2/0/nut
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    bottom
    {
        type symmetry;
    }

    top
    {
        type symmetry;
    }

    sideMin
    {
        type symmetry;
    }

    sideMax
    {
        type symmetry;
    }

    fish
    {
        type nutkWallFunction;
        value uniform 0;
    }
}
